# Аккорды по тональностям
CHORDS_TYPE_BY_NOTE = ['A', 'A#|Bb', 'B|H', 'C', 'C#|Db', 'D', 'D#|Eb', 'E', 'F', 'F#|Gb', 'G', 'G#|Ab']

# Аккорды для каждой тональности
CHORDS_BY_NOTE = {
    'A': ['A', 'Am'],
    'A#|Bb': ['A# | Bb', 'A#m | Bbm'],
    'B|H': ['B | H', 'Bm | Hm'],
    'C': ['C', 'Cm'],
    'C#|Db': ['C# | Db', 'C#m | Dbm'],
    'D': ['D', 'Dm'],
    'D#|Eb': ['D# | Eb', 'D#m | Ebm'],
    'E': ['E', 'Em'],
    'F': ['F', 'Fm'],
    'F#|Gb': ['F# | Gb', 'F#m | Gbm'],
    'G': ['G', 'Gm'],
    'G#|Ab': ['G# | Ab', 'G#m | Abm']
}

# Аккорды по типам (стилям)
CHORDS_TYPE_BY_STYLE = ['Major', 'Minor']

# Аккорды для каждого типа
CHORDS_BY_STYLE = {
    'Major': ['A', 'A# | Bb', 'B | H', 'C', 'C# | Db', 'D', 'D# | Eb', 'E', 'F', 'F# | Gb', 'G', 'G# | Ab'],
    'Minor': ['Am', 'A#m | Bbm', 'Bm | Hm', 'Cm', 'C#m | Dbm', 'Dm', 'D#m | Ebm', 'Em', 'Fm', 'F#m | Gbm', 'Gm', 'G#m | Abm']
}

# Описания аккордов
CHORDS_DESCRIPTIONS = {
    'A': 'Ля мажор',
    'Am': 'Ля минор',
    'A# | Bb': 'Ля-диез мажор | Си-бемоль мажор',
    'A#m | Bbm': 'Ля-диез минор | Си-бемоль минор',
    'B | H': 'Си мажор',
    'Bm | Hm': 'Си минор',
    'C': 'До мажор',
    'Cm': 'До минор',
    'C# | Db': 'До-диез мажор | Ре-бемоль мажор',
    'C#m | Dbm': 'До-диез минор | Ре-бемоль минор',
    'D': 'Ре мажор',
    'Dm': 'Ре минор',
    'D# | Eb': 'Ре-диез мажор | Ми-бемоль мажор',
    'D#m | Ebm': 'Ре-диез минор | Ми-бемоль минор',
    'E': 'Ми мажор',
    'Em': 'Ми минор',
    'F': 'Фа мажор',
    'Fm': 'Фа минор',
    'F# | Gb': 'Фа-диез мажор | Соль-бемоль мажор',
    'F#m | Gbm': 'Фа-диез минор | Соль-бемоль минор',
    'G': 'Соль мажор',
    'Gm': 'Соль минор',
    'G# | Ab': 'Соль-диез мажор | Ля-бемоль мажор',
    'G#m | Abm': 'Соль-диез минор | Ля-бемоль минор',
}